[{"title":"10 Things I Hate About You","year":"1999","director":"Gil Junger","country":"United States","genre":"Comedy","synopsis":"One of the most memorable late 90s rom-coms to date. So many iconic scenes: Julia Stiles flashing the teacher on detention, an iconic Prada backpack conversation, a paintball first date, the black underwear discovery, duck liver and Heath Ledger on the bleachers at soccer practice. This is a great feel good film that takes us back to different times.","recommendation":"Heath Ledger iconically singing into the microphone on the bleachers. Joseph-Gordon Levitt. 90s style. Julia Stiles. Prom. Paintball. Having awkward conversations about sex with your parents. Detention. Sister rivalry. Duck liver.","streamingOptions":"Amazon Prime (US + AU) + Vudu (US) + Disney (US) + iTunes","url":"https://www.youtube.com/watch?v=BEDRYyUSzCc"},{"title":"20,000 Days on Earth","year":"2014","director":"Iain Forsyth & Jane Pollard","country":"United Kingdom","genre":"Documentary","synopsis":"This documentary was so powerful in validating that desire to want to be somebody else at different times in our lives. It exposes what inner turmoil looks like, what grief looks like, what turning yourself on and off looks like. By the time you’re done watching this film, you will realize that all of the austerity of Nick Cave’s public personality seems to have melted away, the barriers to feeling deeply demolished. We go through a therapy session with him, recording in the studio, time with his family, breakfast with a best friend, a live concert and scattered personal encounters. What I love about this documentary is how poetic it is—it shifts respectfully through the landscape of his own legacy.","recommendation":"Madonna. Reading poetry. Therapy. Unconventional ways of thinking. Transforming yourself.","streamingOptions":"Amazon Prime (US) + DocPlay + iTunes + Lido (AU)","url":"https://www.youtube.com/watch?v=Ap0_y5EGttk"},{"title":"20th Century Women","year":"2016","director":"Mike Mills","country":"United States","genre":"Drama","synopsis":"This is a film about family, about generational gaps, about coming-of-age, but mostly just relationships—of all kinds. It reminds you how hard it is to be young and perhaps makes you better understand your mum. When you look at the set and the composition of the shots, it makes sense that this is a film directed by a graphic designer turn film director. The colours and characters sing in every frame; somehow each shot feels both effortless yet considered. The trailer, in itself, is like a short film.","recommendation":"The 80s. Communal living.","streamingOptions":"Netflix (US) + Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=6JnFaltqnAY"},{"title":"A Bigger Splash","year":"1974","director":"Jack Hazan","country":"Italy","genre":"Docufiction","synopsis":"Not to be confused with Luca Guadagnino ‘A Bigger Splash’ (which is also excellent), this documentary features iconic British painter David Hockney. I first watched this film at the 4pm showing to an empty cinema at The Metrograph. I was reminded that it’s rare for a great painter to be successful in his or her own lifetime, and as someone who battles with the creative process daily, this film really unpacks the 1970s narratives of self-hatred and self-pity in a relatable way. It acts as a record of artistic creation that is itself a work of art. The way Hockney talks about love does remind me of Luca Guadagnino’s ‘Call Me By Your Name’—how difficult it is to move on from. Hockney says, “when love goes wrong, there’s more than two people that suffer.” I loved this film because it really opens up the inner world of David Hockney, his friends and his agonizing and lingering affair with his muse Peter.","recommendation":"1970s. Documentaries. Buying expensive art. Loud parties. Spying in on the neighbors.","streamingOptions":"Amazon Prime","url":"https://www.youtube.com/watch?v=HnKQpmfdZhQ"},{"title":"A Bigger Splash","year":"2015","director":"Luca Guadagnino","country":"Italy","genre":"Drama","synopsis":"There are all the ingredients for the perfect summer holiday: a remote Italian villa, a swimming pool with a view for miles, karaoke and Tilda Swinton. And there are all the ingredients for one that’s doomed to end in disaster: your partner invites their ex to join you, their ex needs a lot of attention, you’ve lost your voice. This film is the ultimate Luca Guadagnino European getaway with a light drizzling of sex, drugs and rock and roll.","recommendation":"Summers in Italy with Dakota Johnson and Tilda Swinton. Complex dynamics on family holidays. Éric Rohmer.","streamingOptions":"Amazon Prime (US) + iTunes","url":"https://www.youtube.com/watch?v=1mOVgI0-pb4"},{"title":"A Secret Love","year":"2020","director":"Chris Bolan","country":"United States","genre":"Documentary","synopsis":"This is a documentary about two women who decided to come out late in life. Terry Donahue and Pat Henschel came together in a different world. The women fell in love in 1947, when norms around living openly as a gay person in the United States were far from what they are today. Though essentially inseparable from the moment they met, they managed to keep their true relationship a secret for more than six decades. To family and coworkers they were simply good friends and roommates; others knew them as cousins who lived together. Donahue played on the baseball team that inspired the film ‘A League of Their Own’, which shows us beautifully the very public athletic life in tandem with a very private romantic one.","recommendation":"A League of Their Own (1992). Baseball. Ryan Murphy. Breaking the rules.","streamingOptions":"Netflix (US + AU)","url":"https://www.youtube.com/watch?v=ghv3-lpFOcc"},{"title":"A Single Man","year":"2009","director":"Tom Ford","country":"United States","genre":"Drama","synopsis":"In the 1960s, a professor mourns (played by a very handsome Colin Firth) mourns the death of his longterm boyfriend. At stake for him? The meaning and resonance of relationships… and life itself. The impeccable taste of fashion design-turn-director Tom Ford is all over this film: the interiors, the clothes, the shots… Every frame is cinematic perfection.","recommendation":"Mid-century interiors. Alvar Aalto. Organising your wardrobe.","streamingOptions":"Netflix (US) + SBS On Demand + Stan (AU)","url":"https://www.youtube.com/watch?v=Ell2a6o_6lY"},{"title":"Adaptation","year":"2002","director":"Spike Jonze","country":"United States","genre":"Comedy","synopsis":"A classic case of writer’s block has never been so surreal (or satisfying). The film follows a brilliant Nicolas Cage as Charlie Kaufman—not to be confused with the IRL Charlie Kaufman, credited for this screenplay, along with ‘Eternal Sunshine of the Spotless Mind’ and ‘Being John Malkovich’—a hyper-self-conscious L.A. screenwriter on a deadline. He’s been tasked with adapting (real-life) writer Susan Orlean’s book ‘The Orchid Thief’, though here she’s portrayed by none other than Meryl Streep. (Need I say more?) As this Russian Doll of a story unfolds, Kaufman’s life and Orlean’s story become uncannily entwined. A film about passion, narrative, creative anxiety, and rare blooms that asks: where do we draw the line between The Real and The Cinematic?","recommendation":"Life imitating art. Obsession. Paranoia. Self-referential surrealism. LA v. NY.","streamingOptions":"Criterion Channel + Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=BMwOEkTmTyQ"},{"title":"Amélie","year":"2001","director":"Jean-Pierre Jeunet","country":"France","genre":"Romance","synopsis":"‘Amélie’ is a fanciful comedy about a young woman who discretely orchestrates the lives of the people around her, creating a world exclusively of her own making. Shot in over 80 Parisian locations, acclaimed director Jean-Pierre Jeunet invokes his incomparable visionary style to capture the exquisite charm and mystery of modern-day Paris through the eyes of a beautiful ingenue.","recommendation":"Wandering through Paris. Self-growth. Colorful imagery. Crème brûlée. Imagination.","streamingOptions":"Hulu + Amazon Prime + SBS On Demand","url":"https://www.youtube.com/watch?v=HUECWi5pX7o"},{"title":"American Beauty","year":"1999","director":"Sam Mendes","country":"United States","genre":"Drama","synopsis":"‘American Beauty’ is an incisive, deliriously funny and profound vision of the “American Dream” hitting meltdown. It’s about male empowerment and self-discovery. A suburban dad is falling for his teenage daughter’s flirty friend, his wife’s having an affair with a real estate agent, his daughter’s being videotaped by their new neighbour through the window and in amongst it all are these now iconic vignettes of rose petals raining on Mena Suvari’s naked body. A plastic bag floating in the wind will never look the same again.","recommendation":"Understanding what ordinary means in America.","streamingOptions":"Amazon Prime + iTunes + Stan","url":"https://www.youtube.com/watch?v=3ycmmJ6rxA8"},{"title":"American History X","year":"1998","director":"Tony Kaye","country":"United States","genre":"Crime","synopsis":"I’m not easily sold on a neo-Nazi gang film, but this film is something else. It reminds us that everyone has a back story and people are capable of change.","recommendation":"Understanding people.","streamingOptions":"Hulu + Amazon Prime + Netflix (AU)","url":"https://www.youtube.com/watch?v=JsPW6Fj3BUI"},{"title":"Amores Perros","year":"2000","director":"Alejandro González Iñárritu","country":"Mexico","genre":"Drama","synopsis":"A horrific car accident connects three stories, each involving characters dealing with loss, regret, and life’s harsh realities, all in the name of love. Get ready for over 2.5 hours of a chaos, anxiety, blood, tears and dog fighting.","recommendation":"Inter-connected storylines. Hard-to-watch films.","streamingOptions":"Netflix (BR + US) + iTunes + Amazon Prime + Prime Video (AU)","url":"https://www.youtube.com/watch?v=A5HTBYR7m0o"},{"title":"An Unmarried Woman","year":"1978","director":"Paul Mazursky","country":"United States","genre":"Drama","synopsis":"This film should be required watching for every woman—ever. As someone who has always wrestled with finding and understanding who I am—perhaps this will be my life’s work—this film was pivotal. ‘An Unmarried Woman’ is communal; it speaks to finding and losing. I chuckled thoroughly listening to Jill Clayburgh rant on with her therapist—also, please note her therapists outfit in these scenes. After seeing the beginning I kept wondering how Paul Mazursky was going to end the film, and he did not disappoint. The last scene should be printed, framed and hung in a gallery wall forever. Also this classic line is a great back pocket mantra. \n“Balls, said the Queen—\nIf I had ’em I’d be King.”","recommendation":"Being the bigger person. Moving on and getting over breakups.","streamingOptions":"Criterion Channel","url":"https://www.youtube.com/watch?v=xneTKSwNkug"},{"title":"Annie Hall","year":"1977","director":"Woody Allen","country":"United States","genre":"Comedy","synopsis":"Woody Allen drove me nuts in this film. He is the template for getting on one’s nerves: neurotic, wisecracking and kvetching. Diane Keaton is unforgettable and iconic, especially for her beloved style. I started reading Diane Keaton’s memoir ‘Then Again’ on a recent trip to Mexico and was so moved by her relationship with her mother. I had to re-watch Annie Hall when I got home and only saw her mother watching it. Before you re-watch this classic, read this book—it will only enrich the experience. The book begins with. “Mom loved adages, quotes, slogans. There were always little reminders pasted on the kitchen wall. For example, the word THINK. I found THINK thumbtacked on a bulletin board in her darkroom. I saw it Scotch-taped on a pencil box she’d collaged. I even found a pamphlet titled THINK on her bedside table. Mom liked to THINK.”","recommendation":"Diane Keaton. Breaking romantic rules. Unsettled endings. Wearing menswear.","streamingOptions":"Amazon Prime + Criterion Channel + iTunes + Stan","url":"https://www.youtube.com/watch?v=OqVgCfZX-yE"},{"title":"Atlantics","year":"2019","director":"Mati Diop","country":"France","genre":"Drama","synopsis":"This is a very mystical film with a ghost-like moodiness. The films begins with a group of young boys from Senegal who argue over unpaid wages and set off in the middle of the night by boat for the coast of Spain never to return as themselves—only ghosts demanding retribution. It’s an abstract, poetic coming-of-age ghost, love story. What makes Mati Diop’s work so moving for me, personally, is her desire to tell the story of the underdog, and the forgotten—those who have been marginalized by mainstream society. It can be easy, especially with coming-of-age stories, to feel culturally alienated when you don’t see anyone like yourself represented on the screen, but Mati did this beautifully. I hope more directors continue to do so.","recommendation":"Ghost stories. Tweeting about capitalism. Advocating for marginalized groups of people. Films that feel witchy.","streamingOptions":"Netflix (US + AU)","url":"https://www.youtube.com/watch?v=Cv3BWPfBwYc"},{"title":"Bacurau","year":"2019","director":"Juliano Dornelles","country":"Brazil","genre":"Sci-Fi","synopsis":"Bacurau is a remote Brazilian village that’s oddly disappeared from Google Maps. All the phones have stopped working, coffins line the roads, and then, a UFO hovers into view. ‘Bacurau’ is a sci-fi survival thriller that bends genres into a parable of exploitation and resistance.","recommendation":"Sci-fi thrillers.","streamingOptions":"Mubi","url":"https://www.youtube.com/watch?v=Fhjqvb60LLw"},{"title":"Basic Instinct","year":"1992","director":"Paul Verhoeven","country":"United States","genre":"Thriller","synopsis":"While this film received mixed reactions, Sharon Stone is unforgettable. Explicit sex scenes, unrepentant nudity and the lurid excesses that Verhoeven loves to fill his films with, and for good reason.","recommendation":"Seduction. True crime podcasts. Cat and mouse mind games.","streamingOptions":"Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=Jh6JwQ8XPK0"},{"title":"Beaches","year":"1988","director":"Gary Marshall","country":"United States","genre":"Drama","synopsis":"For some reason, while in the middle of a global pandemic, Brooklyn has decided tis the season for bread—dough is being kneaded, twisted, stretched, pummelled and manipulated, all in the name of social distancing. To know just how that must feel, put yourself at the mercy of ‘Beaches’, the story of an abiding friendship between two very different women over a very long period of time. This is for anyone who loves flashbacks, long enduring friendships, Bette Midler and a smidge of jealousy.","recommendation":"Occasional jealousy. Long distance friendships. Atlantic City boardwalk. Having a pen pal.","streamingOptions":"HBO + Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=G59ivoXtmW4"},{"title":"Before Sunrise","year":"1995","director":"Richard Linklater","country":"United States","genre":"Romance","synopsis":"I do think Richard Linklater really launched the 90s indie film movement. I recently learned this film was inspired by Linklater’s own experience encountering a woman in a Philadelphia toy store—how charming. This is a great trilogy for anyone who has been in a relationship for a long time and understands how love evolves over time; it begins, begins again, deepens, and strains the longer you’re in it. It’s a trilogy based on one brief encounter that feels entirely genuine.","recommendation":"Trilogies. Missed connections. Listening to the Modern Love podcast. Following the @90sanxiety Instagram account.","streamingOptions":"Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=9v6X-Dytlko"},{"title":"Beginners","year":"2011","director":"Mike Mills","country":"United States","genre":"Drama","synopsis":"This film is about loneliness and the nature of love. If you’ve ever been to a party and still felt lonely, you’ll like this film. It has one of the most beautiful opening sequences ever made. It is rich with history, honesty and beautifully charged emotional moments: recollections of budding romance, a father coming out in his 70s, finding yourself at a dress up party. Now that I am older, I love watching films that speak to the complexities of modern relationships: love, obligation, change, sadness, honesty, and mourning. Mike Mills has done a great job of is showing the internal and external fears of a father and son. Hal fears death and homophobia, World War II and being 25 and Oliver suffers the more internal fears of being in your own head and the unedited chaos of everything that floats around in your own mind.","recommendation":"Realizing that parents have the capacity to change. Dogs. Talking to your dogs. Looking at other people’s dogs. Explaining ‘house’ music to your parents. Feeling sad. Meeting people at parties.","streamingOptions":"Amazon Prime + Hulu + iTunes + Vudu","url":"https://www.youtube.com/watch?v=rXUFUp6vsxg"},{"title":"Belle de Jour","year":"1967","director":"Luis Buñuel","country":"France","genre":"Drama","synopsis":"Based on the 1928 novel, ‘Belle de Jour’, by Joseph Kessel, the film is about a young woman who spends her midweek afternoons as a high-class prostitute while her husband is at work. Starring Catherine Deneuve, Jean Sorel and Michel Piccoli, it won the Golden Lion and the Pasinetti Award for Best Film at the Venice Film Festival in 1967. A warning that some scenes may be confronting.","recommendation":"Immaculate eyeliner. Perfectly restored 60s cinema. Observations on the complexity of sex.","streamingOptions":"Amazon Prime + Criterion Channel + iTunes","url":"https://www.youtube.com/watch?v=gC1lO7lqMuw"},{"title":"Best in Show","year":"2000","director":"Christopher Guest","country":"United States","genre":"Mockumentary","synopsis":"I don’t have a dog, so I feel like I am able to say this, but I think that dogs almost always look like their owners, as is the case with this film! I would say that the cure for almost any blues is to laugh at a Christopher Guest film and, as my friend Alexandra Madden suggests, probably start with ‘Best In Show’. This film is about a dog show and the neurosis of their owners. It’s impossible to choose a favorite couple between the neurotic yuppies who dump their marital baggage on their demoralized pup, the gay couple who over groom their toy Shih Tzu or the doltish husband who was born with two left feet and a millionaire trophy wife. Every couple is an affectionate caricature of middle America exaggerated but, then again, maybe not?","recommendation":"Going to dog shows. Mockumentaries. Laughing uncontrollably. Middle America.","streamingOptions":"Amazon Prime","url":"https://www.youtube.com/watch?v=yeifMjqpsg0"},{"title":"Black Girl","year":"1966","director":"Ousmane Sembène","country":"Senegal","genre":"Drama","synopsis":"A Senegalese housemaid is brought to France by the white family she works for, finding herself isolated in an unfamiliar country and trapped in a life of domestic servitude, a situation that she refuses to accept. The film is shot in stark monochromatic tones, and resonates equally as a vivid character study and commentary on the inequalities of power relations between cultures.","recommendation":"Postcolonial films. Symbolism. Resistance and a bit of a rebellious attitude.","streamingOptions":"Criterion Channel + Amazon Prime","url":"https://www.youtube.com/watch?v=BoKAOfcQGgo"},{"title":"Boogie Nights","year":"1997","director":"Paul Thomas Anderson","country":"United States","genre":"Drama","synopsis":"If you ever wondered when the Golden Age of Porn was, it was the 1970s. And it was in L.A. Enjoy 2.5 hours of an all-star cast dancing between pool parties, discos and velour couches on rollerblades and on coke. It’s one big party in full saturated colour with the best in 70s suits, hoops and bikinis.","recommendation":"Heather Graham on rollerblades. Julianne Moore as your favourite 70s dreamboat. Pool parties. Making movies at home.","streamingOptions":"Amazon Prime (US) + iTunes + Vudu + Netflix (AU)","url":"https://www.youtube.com/watch?v=pOk0fsMGyck"},{"title":"Breathless","year":"1960","director":"Jean-Luc Godard","country":"France","genre":"Crime","synopsis":"I’m reading ‘Godard on Godard’ right now; the book has been sitting on my desk with a thousand others waiting to be finished. You can’t talk about cinema or lists of films without including Godard. ‘Breathless’ is very important to me because it was the first film I ever saw that actually surprised me and deeply impressed me. Godard did say, “all you need for a movie is a gun and a girl”. I love Jean Seberg in this film… (SPOILER ALERT) How in the final minutes of the film, she sells him out to the police to prove she’s not in love. Instead of running, though, Michel stays with her, waiting to be caught—a perverted version of the Romeo-and-Juliet story she cherishes. He dies. She lives. The movie ends.","recommendation":"Black and white films. Paris. Breakfast in bed. Avoiding paying your parking tickets.","streamingOptions":"Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=ib1OMh5fTkQ"},{"title":"Call Me By Your Name","year":"2017","director":"Luca Guadagnino","country":"Italy","genre":"Romance","synopsis":"This film is drenched in everything that makes spending a summer in Italy a dream: fruit trees, piazzas, bike rides, swimming, reading and… a summer romance. This is the love story of Elio and Oliver unfolding in and around a fairytale-like Italian villa where Elio plays Bach on the grand piano in the lounge room and everyone drinks freshly-squeezed apricot juice for breakfast. There’s a scene towards the end of the film where Elio’s dad speaks to him about love and life—the film is worth watching for those few minutes alone. But really, every scene is magic, dappled in the fruity, tender and lush touch of Luca Guadagnino.","recommendation":"Summer in Italy. Nosebleeds. A dance floor. Being reminded of the first time you fell in love.","streamingOptions":"Amazon Prime (US) + iTunes + Netflix (AU) + Vudu","url":"https://www.youtube.com/watch?v=Z9AYPxH5NTM"},{"title":"Capernaüm","year":"2018","director":"Nadine Labaki","country":"Lebanon","genre":"Drama","synopsis":"After running away from his negligent parents, committing a violent crime and being sentenced to five years in jail, a hardened, streetwise 12-year-old Lebanese boy sues his parents in protest of the life they have given him. Directed by Lebanese filmmaker Nadine Labaki, and featuring non-actors, this Cannes Jury Prize-winning film is like not other.","recommendation":"Kids who fight against all odds. Female filmmakers. True stories.","streamingOptions":"Amazon Prime + Netflix (US) + iTunes + Lido (AU) + Golden Age Cinema (AU) + Kanopy (AU) + SBS On Demand (AU)","url":"https://www.youtube.com/watch?v=ULUo0048xZE"},{"title":"Carol","year":"2016","director":"Todd Haynes","country":"United States","genre":"Romance","synopsis":"I was in New York when I first saw this film. It was pelting down rain and I arrived at The Paris Theatre drenched. There was something romantic about being tucked inside that single screen cinema in Manhattan knowing that same city that was on the screen was just outside. Only ‘Carol’ is set some 60 years earlier; it’s a very different New York. It’s the 1950s and everything is beautiful in that nostalgic kind of way—the cars, the clothes, the streets—except these two women who fall in love can’t be together. Cate Blanchett is sublime. Every frame of the film is like a perfectly-composed photo washed with a mysterious green hue.","recommendation":"1950s New York. Christmas. Snow.","streamingOptions":"Amazon Prime + Netflix (US + AU) + SBS On Demand + Kanopy (AU)","url":"https://www.youtube.com/watch?v=679wr31SXWk"},{"title":"Certain Women","year":"2016","director":"Kelly Reichardt","country":"United States","genre":"Drama","synopsis":"Watching this film is like taking a Valium and having a troubled elderly woman stroke your hair. It’s based on three short stories by Maile Meloy, set in a sleepy town in Montana. Its pace is slow, and its stories meander. So pour yourself some herbal tea and wrap yourself in blanket.","recommendation":"When Laura Dern plays a lawyer.","streamingOptions":"iTunes + Amazon Prime + SBS On Demand","url":"https://www.youtube.com/watch?v=1_Lznehy2-s"},{"title":"Charulata","year":"1964","director":"Satyajit Ray","country":"India","genre":"Drama","synopsis":"Translating to “the lonely wife”, ‘Charulata’ tells a story of just that: a young and beautiful woman who feels neglected by her husband in 19th Century Calcutta. In their grand home, she spends her days—where time never seems to be a factor—getting lost in thought and engaging in artistic pursuits as a means to discover her true self.","recommendation":"Satyajit Ray. Poetry. Millennial Mambo (2001).","streamingOptions":"Amazon Prime","url":"https://www.youtube.com/watch?v=KpwEbUKGIQs"},{"title":"Children of Heaven","year":"1997","director":"Majid Majidi","country":"Iran","genre":"Drama","synopsis":"A beautifully perceptive film that explores childhood, the unique nuances between siblings and their shared experiences, and the unwavering hope, resilience, and determination that can be found in children.","recommendation":"Bicycle Thieves (1948). Childhood innocence. A good running race. Getting a new pair of shoes.","streamingOptions":"Vudu + Google Play + Prime Video (AU) + Amazon Prime (US)","url":"https://www.youtube.com/watch?v=dqxvZeQsVzY"},{"title":"Chungking Express","year":"1994","director":"Wong Kar-wai","country":"Hong Kong","genre":"Drama","synopsis":"Every day, Cop 223 (Takeshi Kaneshiro) buys a can of pineapple with an expiration date of May 1, symbolizing the day he’ll get over his lost love. He’s also got his eye on a mysterious woman in a blonde wig (Brigitte Lin), oblivious of the fact she’s a drug dealer. Cop 663 (Tony Leung Chiu Wai) is distraught with heartbreak over a breakup. But when his ex drops a spare set of his keys at a local cafe, a waitress (Faye Wong) lets herself into his apartment and spruces up his life.","recommendation":"The Cranberries. Fish tanks. Apartment living.","streamingOptions":"Criterion Channel","url":"https://www.youtube.com/watch?v=Bjd7PFf_TFw"},{"title":"Cinema Paradiso","year":"1988","director":"Giuseppe Tornatore","country":"Italy","genre":"Drama","synopsis":"My favorite movie of all time. The ultimate coming-of-age film for people who love movies. This story follows young Salvatore during a post-WWII Sicily where he finds escape through his local movie theater, Cinema Paradiso. The middle-aged projectionist, Alfredo, teaches him the power and magic of film and the unlikely pair become close friends. As Salvatore grows up, he must decide whether to stay in his small town with the people he loves or leave to pursue his dream of filmmaking. Be prepared to feel some feels. And don’t get me started on the score…","recommendation":"Movies about movies. Going to the cinema by yourself.","streamingOptions":"Amazon Prime + Hulu + HBO","url":"https://www.youtube.com/watch?v=C2-GX0Tltgw"},{"title":"Claire’s Knee","year":"1970","director":"Eric Rohmer","country":"France","genre":"Comedy","synopsis":"Who likes knees? What a strange part of the body? In high school I had great difficulty shaving my knees without cutting them. They are knobbly, odd shaped and, once you start paying close attention to them, they get progressively weirder looking. So funny and prankish that this film is dedicated to that part of the body that feels so wonky to me. ‘Claire’s Knee’ is funny and moving and so immaculately realized. It’s a story of a run in between two old lovers who are “in transit”—their real lives are elsewhere.","recommendation":"My Night at Maud’s (1969). Love triangles. Swiss lakes. European summer vacations. Shaving your knees.","streamingOptions":"Criterion Channel + Stan (AU)","url":"https://www.youtube.com/watch?v=KLGpWN1elJ0"},{"title":"Cleo from 5 to 7","year":"1962","director":"Agnès Varda","country":"France","genre":"Drama","synopsis":"Shot in real time, a perfectly-dressed pop star wanders the streets of Paris for two hours while she awaits some medical results. Agnès Varda perfectly captures the anxiety of waiting—the way time has the ability to slow down amidst uncertainty—against a quintessential 1960s Parisian backdrop in a very French New Wave way. She was at the heart of the movement, after all.","recommendation":"The quintessential romance of 1960s Paris.","streamingOptions":"Mubi","url":"https://www.youtube.com/watch?v=sRR0_VJFqwg"},{"title":"Close-Up","year":"1990","director":"Abbas Kiarostami","country":"Iran","genre":"Docufiction","synopsis":"I would tell you what this film is about but I think that would take something away. I’ll just say it’s probably the most human film I’ve ever seen. It’s about the people who we dream of being but never will be because, ultimately, we are all born into different worlds. It’s about escape. It’s about forgiveness. It’s about class divide. Don’t read too much more about it, just watch it and then read about how it was made afterwards. A piece of cinema like no other.","recommendation":"True stories. Filmmaking. Forgiveness.","streamingOptions":"Amazon Prime + Criterion Channel","url":"https://www.youtube.com/watch?v=hjLVCiAtvls"},{"title":"Cold War","year":"2018","director":"Paweł Pawlikowski","country":"Poland","genre":"Romance","synopsis":"Cold War is an artfully crafted, flawlessly acted meditation on love, memory and invented history. It’s a love story between two people who often can’t stand to be together, but can’t bare to live apart. It uses the European political turmoil in the decades just after the Second World War to show us how love can be affected by such events, by borders enforced harshly, by time that is not kind on those who struggle, by a world split in two by a line of political difference. There’s no real happiness, and no real answer to their problem; people change, cultures change, but can love stay the same?","recommendation":"Black-and-white cinema. Drunk dancing. Hearing about your parents’ love stories. Polish music. Joanna Kulig singing. Old love and old memories.","streamingOptions":"Kanopy (AU) + Amazon Prime (US) + SBS On Demand (AU)","url":"https://www.youtube.com/watch?v=8ImvkXgGVWw"},{"title":"Daughters of the Dust","year":"1991","director":"Julie Dash","country":"United States","genre":"Drama","synopsis":"You never know when a work of art—whether it’s a sculpture, book, mural or photograph—is going to punch you in the gut with inspiration or understanding or emotion, and with an impact that will last the rest of your life. ‘Daughters of the Dust’ did that for me; it’s a work of spellbinding visual beauty. There is a tangible pressure in the choice to either preserve one’s culture or migrate to the mainland and risk giving it up. The imagery in this film is so poetic, imaginative and somehow both embraces the historical idea and converts it in the sharp specificity of personal experience.","recommendation":"Beyonce’s ‘Lemonade’. Shakespeare’s Tempest. Dreams. Preserving culture and history.","streamingOptions":"Criterion Channel + Amazon Prime","url":"https://www.youtube.com/watch?v=FRpTae7jmi4"},{"title":"Dead Poet’s Society","year":"1989","director":"Peter Weir","country":"United States","genre":"Drama","synopsis":"I own this film on DVD (ha!) and rewatched it only recently and had forgotten just how good it is. It should be mandatory watching for any young person growing up so we can all feel unafraid to carve our own path. It shows us the joys of friendship, the collective power of a club, the beauty of books and the importance of standing up for what you believe in.","recommendation":"Robin Williams. Books. Poetry. Secret clubs.","streamingOptions":"Amazon Prime + Beth’s DVD collection","url":"https://www.youtube.com/watch?v=4lj185DaZ_o"},{"title":"Dirty Dancing","year":"1987","director":"Emile Ardolino","country":"United States","genre":"Romance","synopsis":"Endlessly quotable—obviously, strangely fascinating and immensely charming, there’s a reason that Dirty Dancing retains an evergreen appeal of first love. And it takes a hard heart not to grin at the final, euphoric dance number. A phenomenon that virtually every twenty-something woman in the modern world watched as a pre-teen.","recommendation":"Patrick Swayze. Iconic Soundtracks. Sleepy Catskill towns.","streamingOptions":"Hulu + HBO Max + Amazon Prime (US)","url":"https://www.youtube.com/watch?v=eIcmQNy9FsM"},{"title":"Do the Right Thing","year":"1989","director":"Spike Lee","country":"United States","genre":"Drama","synopsis":"This is a Spike Lee sensation. It’s the late 80s and it’s the hottest day of the year in NYC. The sun is out, fire hydrants are bursting, boom boxes are booming. The first two thirds of the film feel very similar to ‘Dazed and Confused’ (made just a fews later, Linklater was no doubt influenced by Lee) as we spend a full 24hrs following a bunch a locals go about their day in Bed-Stuy, Brooklyn. The intermittent sax, the occasional slow-mo shot (there’s one at around the 30 min mark that is instantly unforgettable), the fashion shoot-like angles, the color that bursts out of every frame… it all feels very cool. Until it’s not. The film (spoiler alert) feels as relevant as ever with its eerily similar and heartbreaking storyline to the present day killing of George Floyd, ultimately urging us all to step up and do the right thing.","recommendation":"Spike Lee. Samuel L. Jackson as a radio host. Dazed and Confused (1993). Understanding the complexities and injustices of racial discrimination in America.","streamingOptions":"iTunes + Amazon Prime","url":"https://www.youtube.com/watch?v=muc7xqdHudI"},{"title":"Donnie Darko","year":"2001","director":"Richard Kelly","country":"United States","genre":"Sci-Fi","synopsis":"This is a film that finds new life the older it gets. There is a sort of universal weirdness to being a teenager; regardless of when it was, there are these thresholds that never go away. A boy becoming a man, a girl becoming a woman, confronting painfully awkward things. Imagine the end of the world… Imagine 28 days until the end of the world? Imagine sleepwalking and seeing a demonic looking rabbit called Frank. This is a film that balances mental illness and a parallel universe with emotional intensity and a complex plot.","recommendation":"Elections. Internal anxieties. Pet Shop Boys. Debating the sexual habits of the Smurfs. Time travel. Maggie and Jake Gyllenhaal.","streamingOptions":"SBS On Demand + iTunes + Amazon Prime (US) + Tubi + Lido (AU) + Kanopy (AU)","url":"https://www.youtube.com/watch?v=bzLn8sYeM9o"},{"title":"Drive","year":"2011","director":"Nicolas Winding Refn","country":"United States","genre":"Action","synopsis":"This is probably the most beautiful, sexy (but not in a conventional sexy kind of way) and subtle thriller you will see. Even the car chase scenes are beautiful and I’m not into cars! The chemistry between Ryan Gosling and Carey Mulligan is sensational, as is the score (Clint Mansell). Even the font on the movie poster felt iconic the moment it was released.","recommendation":"A man of few words. Driving fast to good music.","streamingOptions":"Netflix (US) + Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=KBiOF3y1W0Y"},{"title":"Eternal Sunshine of the Spotless Mind","year":"2004","director":"Michel Gondry","country":"United States","genre":"Sci-Fi","synopsis":"Have you ever been in love with someone and felt so heartbroken afterwards that you wish you could erase them from your mind so you didn’t have to deal with the pain? Well in this world you can. Clementine (Kate Winslet with interchanging bright blue and orange hair) and Joel (Jim Carrey in perhaps his best performance to date) are in love. They break up and decide to remove each other from their memories with the help of some strange, very DIY Michel Gondry-esque technology. In this otherworldly, trippy, sci-fi romance, we discover that perhaps we don’t want to erase the pain after all. Maybe there’s some good in the bad that we want to keep. And perhaps it’s okay to feel sad.","recommendation":"Tripping. Sleeping on the beach. Memories.","streamingOptions":"Hulu + Amazon Prime + Netflix (AU)","url":"https://www.youtube.com/watch?v=hZdl2FFp0eA"},{"title":"Everything is Copy","year":"2015","director":"Jacob Bernstein & Nick Hooker","country":"United States","genre":"Documentary","synopsis":"I walked into this doco knowing just a little about Nora Ephron (the woman writer who made her name writing for men’s magazine Esquire before writing films like ‘When Harry Met Sally’) and I left thinking she was my hero. If you’re a writer, you should watch this film. If you are a woman who wants to take control of your life, you should definitely watch this film.","recommendation":"Words. Women who don’t let men determine their future or happiness.","streamingOptions":"HBO + Amazon Prime","url":"https://www.youtube.com/watch?v=N9wiAhnkVBc"},{"title":"Eyes Wide Shut","year":"1999","director":"Stanley Kubrick","country":"United States","genre":"Mystery","synopsis":"I love Stanley Kubrick. We recently went to the Museum of Moving Image exhibit of ‘2001: A Space Odyssey’, which prompted me to re-watch all of his films. After four decades spent upending our understanding of what cinema could achieve, who expected Stanley Kubrick to return from a 12-year hiatus with a film like ‘Eyes Wide Shut’? A rebuke to those believing Kubrick lacked a sense of humour, ‘Eyes Wide Shut’ is the work of someone who stayed ahead of the game until the very end.","recommendation":"Secrets.","streamingOptions":"Hulu + Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=FBrbQSDfh7Q"},{"title":"Five Easy Pieces","year":"1970","director":"Bob Rafelson","country":"United States","genre":"Drama","synopsis":"There is no Whitey Bulger (The Departed) and indeed no megalomaniacal Joker (Batman, 1989) without Bobby Dupea. You might even say that every Jack Nicholson role that follows has common provenance in ‘Five Easy Pieces’. Bobby Dupea needs you to know that he has no actual interest in living. At times comically depressing, his life is a caricature of a no-collar flatfoot from the French New Wave. While Bobby desperately keeps up appearances as an edgy, self-unmade man, an ailing father draws us into his former auspicious beginnings as a piano prodigy from a wealthy family. Nicholson’s spark is immediate and unavoidable. It might even be just where he forged the mold for his singular dark and stormy characters, his trademark angst stretching across his career like a perfectly dark and beguiling Fibonacci. Cinematography by Hungarian wiz László Kovács. Bob Rafelson, a pioneer of the ‘New Hollywood,’ directs a tender and dynamic supporting cast in his second feature.","recommendation":"Broody men. Diners. Old cars. Schumann.","streamingOptions":"Criterion Channel + Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=hdIXrF34Bz0"},{"title":"Frances Ha","year":"2013","director":"Noah Baumbach","country":"United States","genre":"Comedy","synopsis":"No one arrives at the conclusion that your twenties are for figuring it out until you’re entirely out of that decade. This film is a triumph in capturing shared experiences and the agony of being in your twenties. When you can’t fake it, you’re forced to either confront it or ignore it. If you’ve ever had $4 in your bank account, crashed on a friend’s couch for an extended period of time or had your card declined at CVS for shampoo, this film makes you feel less alone.","recommendation":"Coming-of-age films. Being unsure of where to go next. The weekly Manhattan dance class Moves.","streamingOptions":"Amazon Prime (US + AU) + Netflix (US) + SBS On Demand + Kanopy (AU) + Stan","url":"https://www.youtube.com/watch?v=YBn5dgXFMis"},{"title":"Get Carter","year":"1971","director":"Mike Hodges","country":"United Kingdom","genre":"Crime","synopsis":"Cane, a former Northerner turned cockney east end London gangster returns to the North where his brother has recently died. He single handedly takes on a big northern gang to discover a dark underbelly of criminal activity and that all is not as it seems with his brother’s sudden death. Key great moments: going to a northern bar and ordering them to wipe down a glass coz it’s not clean enough in a cockney accent, and bedding all the big haired women including Brit Ekhart who’s style is tre cool, all the cars, and shooting all the sideburn men. What a dude. Five stars ⭐️⭐️⭐️⭐️⭐️","recommendation":"Michael Cane. Any heist or crime/noir movie.","streamingOptions":"iTunes + Stan + HBO","url":"https://www.youtube.com/watch?v=kV4XrUDBlfM"},{"title":"Goodfellas","year":"1990","director":"Martin Scorsese","country":"United States","genre":"Crime","synopsis":"The story of Henry Hill and his life in the mob. The cast, soundtrack, pacing and everything in between delivers a shocking, funny and poignant story about what it means to be a gangster. Not a Godfather-like old Italian family, these are dirty street-smart gangsters. Joe Pesci is especially funny as hell.","recommendation":"Scarface (1983). The Godfather (1972). Pulp Fiction (1994). The Departed (2006). The Usual Suspects (1995).","streamingOptions":"Netflix (US + AU) + Vudu + iTunes","url":"https://www.youtube.com/watch?v=2ilzidi_J8Q"},{"title":"Grease","year":"1978","director":"Randal Kleiser","country":"United States","genre":"Musical","synopsis":"Those leather jackets, those school rivalries, those summer nights. Full of 1950s teen love, cliques and peer pressure, this is the musical love story of wild boy Danny and a squeaky clean Australian tourist Sandy complete with doo-wop’s and hand jive. Thanks to Rizzo and the pink ladies, a catchy soundtrack, colorful cinematography and endlessly quotable lines, it’s truly no wonder this musical is such a well-loved hit.","recommendation":"Drive-in theatres. Olivia Newton John. John Travolta. Musicals. Great soundtracks.","streamingOptions":"Amazon Prime (US + AU) + Vudu (US) + Netflix (AU) + Stan","url":"https://www.youtube.com/watch?v=XTBtQodOkTU"},{"title":"Happy Birthday Marsha","year":"2018","director":"Reina Gossett + Sasha Wortzel","country":"United States","genre":"Short","synopsis":"Marsha P. Johnson was a street queen—an iconic, legendary fixture, trans activist and artist in New York City’s gay ghetto. Her memory and her movement live on despite the mysterious circumstances surrounding her death. As thousands of people take to the streets to protest the rights of Black trans lives right now in New York City, ‘Happy Birthday Marsha’ is as relevant as ever. It is a film that will stick with you.","recommendation":"The Okra Project. Pride. Supporting trans women. Stonewall riots. Street queens. GLITS. For the Gworls.","streamingOptions":"Amazon Prime","url":"https://www.youtube.com/watch?v=N1MmBGgjSC0"},{"title":"Heathers","year":"1989","director":"Michael Lehmann","country":"United States","genre":"Comedy","synopsis":"Shoulder-padded blazers, knee-high socks, tartan, primary colours, scrunchies and, of course, Winona Ryder. I love any film that acts as a general ‘how to’ for what it means to be a teenager, navigating high-school cliques, and the ability to break free of stereotypes in order to discover who you really are. Winona plays the high-school outcast, and Slater plays the guy who teaches that revenge is a dish best served with an attitude. Sign me up.","recommendation":"Weird endings to films. Prom. A pastel pink wardrobe. Looking for ways to get revenge.","streamingOptions":"Amazon Prime + iTunes + Kanopy (AU) + Lido (AU) + Stan","url":"https://www.youtube.com/watch?v=oAAz8AuFkgw"},{"title":"Honeyland","year":"2019","director":"Ljubomir Stefanov & Tamara Kotevska","country":"Turkey","genre":"Documentary","synopsis":"This film is about life and labor— something I have been thinking a lot about lately. It feels like you are watching a poem being read aloud. A documentary about a Macedonian beekeeper’s conflict with her neighbors, which turns into a lyrical environmental parable. She’s the last in a long line of Macedonian wild beekeepers, making a living farming honey in small batches.","recommendation":"Beekeeping. Documentaries. The Lorax. Talking with animals.","streamingOptions":"Hulu + Golden Age Cinema (AU) + Lido (AU)","url":"https://www.youtube.com/watch?v=B27ORUHlp6E"},{"title":"Hunt for the Wilderpeople","year":"2016","director":"Taika Waititi","country":"New Zealand","genre":"Comedy","synopsis":"This film was recommended by my friend Peter at the very beginning of the coronavirus quarantine, a time when all I wanted to watch were films that made me feel good. This film is a drama masquerading as a comedy about an unloved boy who nobody wanted until he got lost. Raised on hip-hop and foster care, city kid Ricky gets a fresh start in the New Zealand countryside. Equal parts road comedy and coming-of-age drama, this touching story reminds us about the journey that growing up is (at any age) and those who help us along the way. Ricky charms us with his hip-hop threads, bolts from the blue, and the bad-boy haikus.","recommendation":"Getting lost. Understanding the strange quirks and charms of children. ‘Wild Pork and Watercress’ by Barry Crump. Dangerous animals and equally threatening people.","streamingOptions":"Hulu + Amazon Prime + iTunes + Kanopy (AU)","url":"https://www.youtube.com/watch?v=tICv8QH3oM0"},{"title":"I Am Love","year":"2009","director":"Luca Guadagnino","country":"Italy","genre":"Romance","synopsis":"A portrait of an upper-class family in Milano centered on the story of the mother: Tilda Swinton, speaking both Italian and Russian beautifully. A film about how she is set free in love.","recommendation":"Tilda Swinton. Italian high society. Really good sex scenes.","streamingOptions":"Amazon Prime + SBS On Demand","url":"https://www.youtube.com/watch?v=0NjA8CIDvZ8"},{"title":"I Am Not Your Negro","year":"2016","director":"Raoul Peck","country":"United States","genre":"Documentary","synopsis":"James Baldwin was a connoisseur of words—a novelist, essayist, playwright and poet. His work had a depth of perception to dismantle the racial assumptions of America and the English language. Based on his unfinished manuscript ‘Remember This House’, this is an important film documenting his life and work. It allows us to form a portrait of the artist through his own words and fully appreciate his unmatched eloquence.","recommendation":"‘If Beale Street Could Talk’ (the 1974 novel by James Baldwin). Reading ‘Giovanni’s Room’ (1956). Understanding the Civil Rights Movement in America. Reading literature and poetry.","streamingOptions":"Amazon Prime + iTunes (US) + Stan + Kanopy (AU) + Lido (AU)","url":"https://www.youtube.com/watch?v=rNUYdgIyaPM"},{"title":"In the Mood for Love","year":"2001","director":"Wong Kar-wai","country":"Hong Kong","genre":"Romance","synopsis":"Can a love story exist without even a kiss, not even a touch? Only in this Wong Kar-wai masterpiece. Set in 1960s Hong Hong, ‘In the Mood for Love’ is both a love song to a city and a piece of art that eloquently captures epic intimacy, romantic longing and fleeting moments. With its aching musical soundtrack and exquisitely abstract cinematography of Hong Kong’s eerily romantic alleyways, diners and tiny apartments by Christopher Doyle and Mark Lee Ping-bin, this film has secured a place in the cinematic canon, and is a milestone in Wong’s redoubtable career.","recommendation":"Hong Kong by night. Forbidden love. Carol (2015).","streamingOptions":"Criterion Channel","url":"https://www.youtube.com/watch?v=dWVDZ98AFhI"},{"title":"Interiors","year":"1978","director":"Woody Allen","country":"United States","genre":"Drama","synopsis":"Set in some of the most beautiful interior settings, this story is about three sisters who all become affected by the sudden separation of their parents. Each sister’s life starts to unravel in response to their mother’s ‘illness’ and behavior. Much like many Woody Allen films, the characters and their idiosyncrasies is what makes this film so interesting and, for many of us, relatable.","recommendation":"70s interiors. Complex family dynamics. Sibling rivalry.","streamingOptions":"Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=2T_dGcXaqFg"},{"title":"Jackie Brown","year":"1997","director":"Quentin Tarantino","country":"United States","genre":"Crime","synopsis":"‘Jackie Brown’ is about being smart. In this film, if you are smart, you will live. Also it’s about scamming. I could watch these characters live, talk, deceive and scheme for hours and hours. Nominating Pam Grier, AKA Jackie Brown, as one of the coolest female leads on the big screen in 97.","recommendation":"Bail bondsman. Samuel L. Jackson. Quentin Tarantino.","streamingOptions":"Stan + Hulu + Amazon Prime","url":"https://www.youtube.com/watch?v=G7HkBDNZV7s"},{"title":"Jules and Jim","year":"1962","director":"François Truffaut","country":"France","genre":"Romance","synopsis":"A tale of two friends of differing dispositions, who are both united and torn apart by the same person. One highlight: the lovely song about “le tourbillon de la vie” or “the whirlwind of life”, which really resonates, especially now.","recommendation":"Love triangles. Drawn out narratives. French New Wave.","streamingOptions":"Amazon Prime + iTunes (US) + Criterion Channel + Kanopy","url":"https://www.youtube.com/watch?v=x5IAYIUKTaI"},{"title":"Kramer vs. Kramer","year":"1979","director":"Robert Benton","country":"United States","genre":"Drama","synopsis":"‘Kramer vs. Kramer’, which has a mum (played by Meryl Streep) and a dad (Dustin Hoffman) fighting it out in court at great expense, was ahead of its time for the way it challenged our expectations of motherhood and womanhood. Few films pull on the heartstrings like ‘Kramer vs. Kramer’—it is a film of immense sensitivity where ideas around parenthood, gender roles and the process of getting a divorce, are closely intertwined and in a state of flux.","recommendation":"Navigating single parenting. Corduroy suits. Meryl Streep. Seeing what custody battles looked like in the 70s.","streamingOptions":"Amazon Prime + Netflix (US + AU)","url":"https://www.youtube.com/watch?v=jNLcfJ06y34"},{"title":"Kusama: Infinity","year":"2018","director":"Heather Lenz","country":"United States","genre":"Documentary","synopsis":"For decades, her work pushed boundaries that often alienated her from both her peers and those in power in the art world. Kusama was an underdog with everything stacked against her: the trauma of growing up in Japan during World War II, life in a dysfunctional family that discouraged her creative ambitions, sexism and racism in the art establishment, mental illness… Most of us know her for the work she produces today, but this woman has been pushing boundaries from the day she landed in New York in the 60s with very little money but enormous will. In fact, probably from the day she was born. Every woman who has ever felt afraid to fight for something should watch this doco.","recommendation":"Overcoming impossible odds. Dots. Japan. New York in the 60s.","streamingOptions":"Hulu + Amazon Prime + iTunes + Golden Age Cinema (AU) + Lido (AU) + Kanopy (AU)","url":"https://www.youtube.com/watch?v=x8mdIB1WxHI"},{"title":"L.A. Confidential","year":"1997","director":"Curtis Hanson","country":"United States","genre":"Crime","synopsis":"There’s an unsolved murder at a downtown Los Angeles coffee shop set in the early 1950s. But with an all-star cast that sees Danny DeVito, Russell Crowe, Guy Pierce, Kevin Spacey and a very seductive Kim Basinger all playing each other against one another, who will come out on top? ‘L.A. Confidential’ has all the essential ingredients of film noir: glitter, decadence and illusions in post-World War II Hollywood dream factories; endemic corruption in the police department; a cynical point of view by a sleazy Hollywood tabloid editor; a gorgeous femme fatale prostitute; and a morally ambivalent ending.","recommendation":"Los Angeles. Police corruption. Sleazy tabloid editors. Fancy, mid-century LA homes.","streamingOptions":"Amazon Prime + Netflix (US + AU)","url":"https://www.youtube.com/watch?v=C4XbnrmbEME"},{"title":"Le Bonheur","year":"1965","director":"Agnès Varda","country":"France","genre":"Drama","synopsis":"One of Agnès Varda’s most provocative films, ‘Le Bonheur’ examines, with a deceptively sunny palette and the spirited strains of Mozart, the ideas of fidelity and happiness in a modern, self-centered world. Set in a tiny suburb near but oh so far from Paris, ‘Le Bonheur’ depicts the events leading up to the collapse of a seemingly perfect marriage and the aftermath of this collapse. It begs the question, what really is happiness? And is the answer different for men and women?","recommendation":"Sunflowers. The Stepford Wives (2004). Scenes from a Marriage (1973). Picnics in the French countryside.","streamingOptions":"Criterion Channel + Mubi","url":"https://www.youtube.com/watch?v=H_apt9n4y88"},{"title":"Leon the Professional","year":"1994","director":"Luc Besson","country":"France","genre":"Action","synopsis":"This is a story of very different worlds intersecting: Leon’s (a hitman with a gentle soul) and Matilda’s (his teenage neighbor played by a young Natalie Portman). Leon lives the perfect hermit life. Cut off from the world, he lavishes his time and energy on his cherished houseplant—carefully watering it, polishing its leaves, and arranging it on a sunny ledge. Leon alternates between his hit man role and an awkwardly affectionate father-figure role. In a way, Matilda needs to be even stronger than Leon. But she has seen so many sad and violent things in her short life, and in her dysfunctional family, that little of the hitman’s life can surprise her. Truly love this film.","recommendation":"Introverts. Lolita by Vladimir Nabokov. Living alone. Killing Eve (2018).","streamingOptions":"Netflix (US) + SBS On Demand + Stan + Kanopy (AU)","url":"https://www.youtube.com/watch?v=jawVxq1Iyl0"},{"title":"Lost in Translation","year":"2003","director":"Sofia Coppola","country":"United States","genre":"Romance","synopsis":"Although it’s one of those bleak comedies, ‘Lost in Translation’ has a great romance at its heart. It really captures what it feels like to be traveling somewhere completely unfamiliar and wanting a connection (aren’t we all, always?). It’s simple but poetic, quietly reminding us of our shared loneliness while making us smile with quintessential Bill Murray humour dotted throughout. Pour yourself a whisky before watching. And then book a karaoke session with friends for afterwards, if you’re still feeling lonely.","recommendation":"Traveling solo. Karaoke. Tokyo. Hotel bars.","streamingOptions":"Hulu, Amazon Prime + Netflix (AU)","url":"https://www.youtube.com/watch?v=sU0oZsqeG_s"},{"title":"Marlina the Murderer in Four Acts","year":"2017","director":"Mouly Surya","country":"Indonesia","genre":"Thriller","synopsis":"When a young widow is raped and and her cattle are stolen, she fights back and kills several of her attackers. She embarks on a journey of redemption and empowerment, but the ghost of one of the men she killed returns to haunt her. Described as a ‘sate western’ and filmed across the sweeping plains of the Indonesian island of Sumba, ‘Marlina the Murderer in Four Acts’ is a visceral drama.","recommendation":"Woman At War (2019). Uma Thurman in Kill Bill. Getting even.","streamingOptions":"Amazon Prime + Kanopy + Stan (AU)","url":"https://www.youtube.com/watch?v=sTuAVGhmgto"},{"title":"Me and You and Everyone We Know","year":"2005","director":"Miranda July","country":"United States","genre":"Comedy","synopsis":"‘No One Belongs Here More Than You’, a book of short stories, was perhaps my first introduction to the genuine voice and special spirit of Miranda July. This film was perhaps my second. It’s been a while since I’ve seen it, but I was in my early years of discovering ‘indie’ films and I remember it making me feel less self-conscious. I think that’s what makes all of her work so special—she has this exceptional ability to make the strange things in all of us, and in life, appear endearing rather than concerning. Her work is potent and should be consumed with an open mind and open heart. If you don’t feel ready to go and watch this film straight away, you might need to watch her video ‘A Handy Tip for the Easily Distracted’.","recommendation":"Real people. Awkward but endearing moments. Miranda July.","streamingOptions":"Criterion Channel","url":"https://www.youtube.com/watch?v=t87QILBZd_I"},{"title":"Melancholia","year":"2011","director":"Lars von Trier","country":"United States","genre":"Sci-Fi","synopsis":"A planet is headed towards Earth and two sisters, unconsciously, have been preparing for this moment, with acceptance or fear. The opening scene is slow and operatic and moving, like a disclaimer that the movie will require patience, both for its characters and others around you. If isolation has also allowed you to think about mortality, then this movie might be a trigger.","recommendation":"Operatic shots. Co-dependent sisters. The sublime. Prime Kirsten Dunst.","streamingOptions":"Vudu + Tubi + iTunes + Lido (AU) + Kanopy (AU)","url":"https://www.youtube.com/watch?v=wzD0U841LRM"},{"title":"Millenium Mambo","year":"2003","director":"Hou Hsiao-Hsien","country":"Taiwan","genre":"Drama","synopsis":"This is a film about going out, staying out and the apartments we come home to. A very seductive film about youth culture and a submersion into the techno-scored neon nightlife of Taipei. An aimless bar hostess drifts away from her blowhard boyfriend and towards a suave, sensitive gangster—structured as a flashback to the then-present from the then-future of 2011.","recommendation":"Blurry nightclub nights. Barry Jenkins’ ‘Moonlight’.","streamingOptions":"Amazon Prime (US) + Tubi","url":"https://www.youtube.com/watch?v=yPZ2Dxk8DZs"},{"title":"Moonrise Kingdom","year":"2012","director":"Wes Anderson","country":"United States","genre":"Comedy","synopsis":"Set in 1965 on the fictional island of New Penzance, ‘Moonrise Kingdom’ follows misfit orphan Sam Shakusky (Jared Gilman) as he escapes his scout camp in search of adventure with his love interest, the bookish Suzy Bishop (Kara Hayward). A ragtag crew of dysfunctional adults (including Bill Murray, Frances McDormand, Bruce Willis and Edward Norton) and increasingly-militant scouts (including Lucas Hedges) start their search for the missing lovers, encountering rival camps, government bureaucracy and natural disasters along the way. Everything in this parallel version of New England is sepia-hued and bursting with analogue invention. There’s also a French New Wave vibe in everything from the chic costumes to the inclusion of Françoise Hardy’s classic pop song ‘Le temps de l’amour’.","recommendation":"Other Wes Anderson films (particularly ‘The Life Aquatic with Steve Zissou’). François Truffaut movies. Feeling nostalgic about childhood. Dancing on the beach. Dreaming about running away.","streamingOptions":"YouTube + Vudu (US) + iTunes","url":"https://www.youtube.com/watch?v=7N8wkVA4_8s"},{"title":"Mulholland Drive","year":"2001","director":"David Lynch","country":"United States","genre":"Mystery","synopsis":"A mind-bending mystery drama. The themes are wild and unconventional: dreams materialised, crazy thought bubbles brought to life. Characters appear and disappear. Late in the running time, after a scene that appears to show her waking from a dream, the protagonist morphs, unexplained, from the optimistic Betty to a haunted-looking, failed actress named Diane.","recommendation":"Amnesia. Twin Peaks (1990).","streamingOptions":"HBO + Amazon Prime + iTunes + Netflix (AU)","url":"https://www.youtube.com/watch?v=vwkCIpLMZBw"},{"title":"Muriel’s Wedding","year":"1994","director":"P. J. Hogan","country":"Australia","genre":"Drama","synopsis":"Some people classify this film as a comedy, but it feels a little bit more tragedy to me. It’s the tale of Muriel (played fabulously by Toni Collette) who lives at home with her dysfunctional family and desperately wants to get married. It’s a heartbreaking story set in a comedic, quintessentially “Australian” set.","recommendation":"Getting drunk at weddings. Trying on wedding dresses even if you’re not engaged, or even have a partner. Going to weddings. Drinking bad cocktails on daggy beach holidays.","streamingOptions":"HBO + Amazon Prime + iTunes + Stan","url":"https://www.youtube.com/watch?v=vwkCIpLMZBw"},{"title":"Mustang","year":"2015","director":"Deniz Gamze Ergüven","country":"Turkey","genre":"Drama","synopsis":"Arranged marriages, 5 sisters, a misunderstanding, neighborhood gossip and a little family scandal is what makes this Turkish coming-of-age story so unique. Think uncontainable independent spirits in a patriarchal culture.","recommendation":"The Virgin Suicides (1999). Sisters. Puzzles. Screaming loudly at relatives. The ocean.","streamingOptions":"Amazon Prime + SBS On Demand + Kanopy (AU)","url":"https://www.youtube.com/watch?v=rU9JAN8LtIk"},{"title":"Near Dark","year":"1987","director":"Kathryn Bigelow","country":"United States","genre":"Horror","synopsis":"A farm boy from a midwestern town meets a strange and attractive drifter. After a midnight drive together, he is abducted by her gang of mulleted outlaw vampires (although, like Let The Right One In (2008), the word vampire is never uttered). What follows is a glorious mix of western and horror as the group go on the run. With an electronic score by Tangerine Dream, a young and psychotic Bill Paxton and maybe the best shoot out sequence I’ve ever seen, this is late 80s bliss.","recommendation":"Western Vampires. A-grade mullets. Lost Boys (1987).","streamingOptions":"SBS on Demand + iTunes + Amazon Prime","url":"https://www.youtube.com/watch?v=hQxnVrg2TSQ"},{"title":"No Country for Old Men","year":"2007","director":"Ethan Coen & Joel Coen","country":"United States","genre":"Western","synopsis":"Violence and mayhem ensue after a hunter stumbles upon a drug deal gone wrong and more than two million dollars in cash near the Rio Grande.","recommendation":"Fargo (1996). The Big Lebowski (1998). Wide open spaces. West Texas Desert. The Coen Brothers. Drug deals gone wrong.","streamingOptions":"Amazon Prime + Netflix (US) + iTunes + Stan","url":"https://www.youtube.com/watch?v=38A__WT3-o0"},{"title":"Now and Then","year":"1996","director":"Lesli Linka Glatter","country":"United States","genre":"Drama","synopsis":"‘Now and Then’ is coming-of-age 90s classic. An essential watch for any girl growing up. It’s a film that does justice to the power of female friendships and the way they help us to cope with life inside the home and all the challenges that come with “growing up”. It will make you want to roll up the sleeves of your oversized shirt and paint your garage door with a bunch of friends while singing to the radio. Or ride your bike down to the river together. Or be there for them when they need a friend.","recommendation":"Seances. Nostalgia. Riding your bike with the radio attached. Summer holidays. Stand By Me (1986).","streamingOptions":"Amazon Prime (US) + Netflix (AU)","url":"https://www.youtube.com/watch?v=vRaw2miRhAw"},{"title":"Office Space","year":"1999","director":"Mike Judge","country":"United Kingdom","genre":"Comedy","synopsis":"A cubicle classic with standardized office routines and some incredibly quotable lines you’ll never forget. Great for anyone who loves to engage in office speak, office politics and spying on your coworkers. Highlights include Milton’s iconic red stapler, the smashing of the printer outside, Jennifer Aniston’s lack of flair and, obviously, Lumbergh.","recommendation":"Reading Molly Young’s ‘Why Corporations Speak the Way They Do’ article. Office politics. Office personalities. Staplers. Meetings.","streamingOptions":"Amazon Prime (US + AU) + iTunes","url":"https://www.youtube.com/watch?v=dMIrlP61Z9s"},{"title":"Paper Moon","year":"1973","director":"Peter Bogdanovich","country":"United States","genre":"Comedy","synopsis":"A wonderful introduction to the production design of Polly Platt. If you haven’t listened to the episode on Polly Platt on the You Must Remember This podcast, please do so immediately. I love all the behind the scenes kinds of people in film, as she is—all the people that have the intuition to turn off a light, the details people who create visual worlds behind newspaper clippings, a postcard, a perfectly curated bedroom, an open field. It’s a wry, dry, very funny, black-and-white road movie that moves along the dusty back roads of the Midwestern flatlands in the depths of the Great Depression. A father daughter con artist duo scamming people with bibles and long drives in between.","recommendation":"Polly Platt. Fathers and daughters. The podcast ‘You Must Remember This’. Con artists. Being on the road. The Great Depression.","streamingOptions":"Criterion Channel + SBS On Demand","url":"https://www.youtube.com/watch?v=ORTv3jORX-I"},{"title":"Parasite","year":"2019","director":"Bong Joon-ho","country":"South Korea","genre":"Thriller","synopsis":"The first foreign film to win Best Film at the Oscars. Trump didn’t understand why, but we all did. ‘Parasite’ tells the story of a poverty-stricken family, the Kims, who cunningly place themselves in the service of the Parks, an obscenely wealthy household who have been (mini spoiler alert) unknowingly harboring a stranger in their basement for years.","recommendation":"Bunkers. The underdog. Crushing on your tutor. Immaculate South Korean architecturally-designed homes.","streamingOptions":"Amazon Prime + iTunes + Hulu + Lido (AU) + Golden Age Cinema (AU)","url":"https://www.youtube.com/watch?v=isOGD_7hNIY"},{"title":"Paris is Burning","year":"1990","director":"Jennie Livingston","country":"United States","genre":"Documentary","synopsis":"Jennie Livingston’s poignant and illuminating documentary focuses on the underground Harlem drag-ball scene of the late 1980s before it was repackaged for the mainstream. I love documentaries like this: those that explore a unique subculture specific to a particular time and place. It chronicles the period as the LGBTQ community meet at flamboyant balls to compete in competitions. With many coming from broken homes and shunned by their families, this camp and glittering community becomes a means of escape as they live out their fantasies. As they transform themselves for the runway duels they become somebody new and special.","recommendation":"Runway face-offs. Unique slang. LGBTQ underground subculture.","streamingOptions":"Amazon Prime (US) + iTunes","url":"https://www.youtube.com/watch?v=o47CwiJLpes"},{"title":"Paris, Texas","year":"1985","director":"Wim Wenders","country":"United States","genre":"Drama","synopsis":"This is the very poignant tale of a man seeking redemption. It follows the enigmatic Travis as he searches for lost love, place and time. Nothing in this movie feels partial, every shot is so beautifully composed, each moment so considered. I remember watching it as a child laying on the floor in my parent’s lounge room and not understanding its themes but finding the music and imagery compelling enough to make it through 2.5 hours. Now I sometimes rewatch it for its pace alone, and to see the alluring buoyancy of Nastassja Kinski’s bob.","recommendation":"Pausing the movie to take screen shots. Minimal, soft spoken dialogue. Looking for loved ones. Twang.","streamingOptions":"Amazon Prime + Kanopy (AU) + iTunes + Criterion Channel","url":"https://www.youtube.com/watch?v=9e590FeeGCM"},{"title":"Picnic at Hanging Rock","year":"1975","director":"Peter Weir","country":"Australia","genre":"Mystery","synopsis":"Spooky Aussie classic. A group of girls from an all-female college vanish, along with a chaperone, while on a St. Valentine’s Day outing. Less of a mystery than a journey into the mystic, as well as an inquiry into issues of class and sexual repression in Australian society. Perhaps I loved it so much because I went to an all girls boarding school and it feels so appropriate to be reminded of the spookiness that surrounds Valentine’s Day in a large group.","recommendation":"Boarding school girls. Mystery. Lovers. The Virgin Suicides (1999).","streamingOptions":"Amazon + iTunes","url":"https://www.youtube.com/watch?v=_WekAj1a4wo"},{"title":"Portrait of a Lady on Fire","year":"2019","director":"Céline Sciamma","country":"France","genre":"Romance","synopsis":"The soundtrack and score is mesmerizing. I left the theatre and went home to read the screenplay. The last scene is eerily similar, emotionally, to Luca Guadagnino’s ‘Call Me By Your Name’. Also I love Claire Mathon as a cinematographer. A fake chaperone, a witchy fire dance scene, a blind painting, long evening dinners and an abortion.","recommendation":"A scandal. The midnight margarita scene in Practical Magic (1998). Timothée Chalamet.","streamingOptions":"Amazon Prime + iTunes + Lido (AU) + Stan (AU)","url":"https://www.youtube.com/watch?v=R-fQPTwma9o"},{"title":"Queen & Slim","year":"2019","director":"Melina Matsoukas","country":"United States","genre":"Drama","synopsis":"While on a forgettable first date together in Ohio, a couple gets pulled over by a police officer for a minor traffic violation. After shooting the officer out of self-defence, the unwitting outlaws go on the run, soon becoming a symbol of trauma, terror, grief and pain for people all across the country. Scored by Dev Hynes and written by Lena Waithe.","recommendation":"Set It Off (1967). Tat Radcliffe. Blood Orange. Emotionally destroying endings.","streamingOptions":"Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=Ip3iE416WxE"},{"title":"Roma","year":"1972","director":"Federico Fellini","country":"Italy","genre":"Drama","synopsis":"I had already been living in Rome for a couple of months, confused by its allure and struggling to resolve the weight of the city’s history with the normalcy of everyday life that surrounded me. Then I watched this film. Fellini orchestrates a fantastical, surreal and unapologetic tribute to the ‘Eternal City’ during the Mussolini years, as told through a series of vignettes marrying documentary with memoir. When the credits rolled, I was still confused. But walking the streets back to my apartment that night, Rome suddenly made sense.","recommendation":"Cities, history and urban spectacle. Italy, but unromaticized.","streamingOptions":"Mubi + Criterion Channel","url":"https://www.youtube.com/watch?v=uF9oUf-1RoI"},{"title":"Roma","year":"2018","director":"Alfonso Cuarón","country":"Mexico","genre":"Drama","synopsis":"This is a great depiction of all the people who keep our families running. Alfonso Cuarón (Gravity, Children of Men) returns to his home country to pay tribute to the women who nurtured him. In a polarized and violent world shaped by childhood memories, Alfonso Cuarón’s masterpiece offers a pure message of human solidarity that transcends class and race, shot in monumental black-and-white cinematography, with its roots firmly grounded in the historical specificity of 1970s Mexico City.","recommendation":"Mexico City. Black and white films.","streamingOptions":"Netflix (US + AU)","url":"https://www.youtube.com/watch?v=6BS27ngZtxg"},{"title":"Samson and Delilah","year":"2009","director":"Warwick Thornton","country":"Australia","genre":"Drama","synopsis":"Alone, adrift and unwanted in the Central Australian bush, Aboriginal teenagers Samson and Delilah set off towards Alice Springs and a new life. This film has little dialogue and speaks to the marginalisation of Indigenous people. It is a film with an unflinching mix of humour and grim realism—a damning indictment and painful reminder of the treatment of Aboriginal peoples by the Australian authorities for too long.","recommendation":"Uluru. Indigenous history. Grim realism. Teenage love stories. Minimalist cinematography.","streamingOptions":"Stan + Amazon Prime + Mubi","url":"https://www.youtube.com/watch?v=2cWDYdXdPaU"},{"title":"Say Anything","year":"1989","director":"Cameron Crowe","country":"United States","genre":"Drama","synopsis":"I think Lloyd is possibly one of Cameron Crowe’s best restless dreamers. He’s surprisingly relatable, all doubt but no fear. He’s the beginning of the very familiar John Cusack persona—nerdy, wisecracking, anxious, but also self-aware and attractive. ‘Say Anything’ seems to be about very big things, but it tends to shrink them down to very little things, because ultimately people are complicated. I think the most romantic scene in the film is when Lloyd is helping Diane’s father write a letter to her and then, of course, the iconic boombox scene.","recommendation":"90s. Fear of Flying by Erica Jong. Boomboxes.","streamingOptions":"Amazon Prime + Hulu + iTunes","url":"https://www.youtube.com/watch?v=Se_eSeEAoX0"},{"title":"She’s Beautiful When She’s Angry","year":"2014","director":"Mary Dore","country":"United States","genre":"Documentary","synopsis":"An overdue documentary flash backs to the US women’s liberation movement. ‘She’s Beautiful When She’s Angry’ arrives at a time when, despite notable gains, the clock seems to be turning backward on many of the issues—reproductive rights, sexual harassment, equal pay, etc.—that “libbers” fought more than 40 odd years ago. It will make you want to keep fighting. We owe it to them, and to ourselves.","recommendation":"Feminism. Protest.","streamingOptions":"Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=6sUsLn7v_wI"},{"title":"Shirkers","year":"2018","director":"Sandi Tan","country":"Singapore","genre":"Documentary","synopsis":"In 1992, Sandi Tan and her childhood friends shot Singpore’s first indie road movie. The 16mm rolls of film were eventually stolen by Sandi’s American collaborator and mentor, George Cardona. More than two decades later, Sandi returns to this lost history and details the betrayal that stole Shirkers, and in some way, returned it to her.","recommendation":"Jean-Luc Godard. Mike Mills. Dwelling in the fleeting impermanence of memory.","streamingOptions":"Netflix (US + AU)","url":"https://www.youtube.com/watch?v=u3wPWCj2L6I"},{"title":"Shoplifters","year":"2018","director":"Hirokazu Koreeda","country":"Japan","genre":"Drama","synopsis":"Six individuals who are struggling to discover their place in the world—each rejected or not supported by those around them—find each other and make their own family. But is love enough to survive this world? Living on the outskirts of Tokyo, the family relies on stealing to source what they need. This film makes us question so much—about what family really means, about relationships, about societal structures, and about the assumptions we can all too often make.","recommendation":"Shared living spaces. Breaking the rules of society. Unconventional families.","streamingOptions":"Hulu + Amazon Prime + iTunes + Lido (AU) + Golden Age Cinema (AU) + SBS On Demand (AU)","url":"https://www.youtube.com/watch?v=9382rwoMiRc"},{"title":"Somersault","year":"2004","director":"Cate Shortland","country":"Australia","genre":"Drama","synopsis":"The journey of a young woman, Heidi, searching for companionship after fleeing her home. Creating a new life in the wintry landscapes of beautiful Jindabyne, Australia, she meets Joe, the son of a local farmer. Heidi slowly forms a relationship with Joe and the physical connection is strong, but there is an ever-present emotional struggle. ‘Somersault’ has a magical feel to it. The cinematography is stunning, not surprising though given director Cate Shortland’s background in photography. A tender debut for both director and lead (Abbie Cornish).","recommendation":"The Australian landscape. Atmospheric soundtracks. Physical connection. Winter","streamingOptions":"iTunes + Google Play","url":"https://www.youtube.com/watch?v=fU0zHux5kHc"},{"title":"Stolen Kisses","year":"1968","director":"François Truffaut","country":"France","genre":"Drama","synopsis":"After being discharged from the army, Antoine Doinel centers a screwball comedy where he applies for different jobs and tries to make sense of his relationships with women.","recommendation":"Nouvelle Vague. Eric Rohmer. Woody Allen.","streamingOptions":"Mubi + iTunes + Criterion Channel","url":"https://www.youtube.com/watch?v=xvEXBdAxdAE"},{"title":"Strictly Ballroom","year":"1992","director":"Baz Luhrmann","country":"Australia","genre":"Romance","synopsis":"Set in Baz Luhrmann’s insular world of Australian competitive ballroom dancing, this film is obviously predictable, but that’s why it’s so good. How could you possibly forget the garish neon-hued costumes, the brash Australian accents and the campiness of everything from the ballroom competition storyline to Paul Mercurio? Scott is a skilful but unorthodox dancer with a browbeating stage mother and a timid father. Abandoned by his shrill dancing partner on account of his maverick sensibility, he learns to trust his instinct that free expression means more than competitive glory as he mentors his protege Fran. I won’t spoil the ending, but there is a wonderfully iconic scene of Paul Mercurio dancing under the rooftop coke sign that is imprinted in my mind.","recommendation":"Overbearing mothers. Baz Luhrmann’s weird humor. Australian competitive ballroom dancing. Barry Fife. Underdogs. The song ‘Time After Time’.","streamingOptions":"Amazon Prime (US) + iTunes + ABC (AU)","url":"https://www.youtube.com/watch?v=lxprz6gOmpg"},{"title":"Taipei Story","year":"1985","director":"Edward Yang","country":"Taiwan","genre":"Drama","synopsis":"‘Taipei Story’ is a mournful anatomy of a city caught between the past and the present. A former national little league team player finds solace by hanging out with hedonistic youths.","recommendation":"Domestic life. Urban structures. Changing careers. Cultural clashes.","streamingOptions":"Criterion Channel","url":"https://www.youtube.com/watch?v=l6jqZSAwHaE"},{"title":"The Black Power Mixtape 1967-1975","year":"2011","director":"Göran Olsson","country":"Sweden","genre":"Documentary","synopsis":"“We have to document our history, and we have to tell the story right.” The Black Power Mixtape is just that—the ultimate mixtape of archival footage from interviews with leaders of the Black Power Movement and commentary by a group of Swedish journalists of the time. Through conversations with Angela Davis, Stokely Carmichael, Bobby Seale, Huey P. Newton and Eldridge Cleaver all recorded between 1967 and 1975—enriched by contemporary interviews with Harry Belafonte, Talib Kweli, Erykah Badu and others—this documentary is a great history lesson that pays fitting tribute to the power of documentary and, from a contemporary point of view, demonstrates the dividends of documentation in the midst of struggle and political activism.","recommendation":"Angela Davis. Rare archival footage. Erykah Badu. The civil rights movement. Hip-hop. Political activism.","streamingOptions":"Amazon Prime + Google Play","url":"https://www.youtube.com/watch?v=jFWHNpfjByQ"},{"title":"The Breakfast Club","year":"1985","director":"John Hughes","country":"United States","genre":"Comedy","synopsis":"I wasn’t allowed to watch TV as a kid—we didn’t have one! I do remember sneaking over to my friend Lauren’s place in the 6th grade to watch this film. I tried to memorize every word, repeating out loud to my brothers, “Does Barry Manilow know that you raid his wardrobe?”","recommendation":"Being stuck at home with your annoying roommates.","streamingOptions":"Hulu + Amazon Prime + iTunes + Netflix (AU)","url":"https://www.youtube.com/watch?v=dkX8J-FKndE"},{"title":"The Color Purple","year":"1986","director":"Steven Spielberg","country":"United States","genre":"Drama","synopsis":"Based on Alice Walker’s Pulitzer Prize-winning 1982 novel, this is an all star classic where a young Oprah and Whoopi show us what it was like to be Black and female in early 20th Century America. The opening scene is reminiscent of Varda’s ‘Le Bonheur’, only the sunflowers are replaced by purple cosmos and instead of the French countryside, we’re somewhere in North Carolina. The shots are magic. The colours are restored to perfection. The tale is too true.","recommendation":"Purple flowers. Strong female characters. Understanding America’s racial history. Farmhouse kitchens.","streamingOptions":"Netflix (AU) + Amazon Prime","url":"https://www.youtube.com/watch?v=HzGrDgu08r8"},{"title":"The Diving Bell and the Butterfly","year":"2007","director":"Julian Schnabel","country":"France","genre":"Drama","synopsis":"This is one of those true stories that’s almost impossible to believe it’s a true story. We watch the former editor of Elle (Paris) Jean-Dominique Bauby—who once seemingly had everything—spend his days in a rehabilitation clinic paralyzed after a stroke. The only thing he can move is his left eye, which becomes his only means to communicate. I can still hear the speech pathologist going through the alphabet in French.","recommendation":"Resilience. The French language. True stories.","streamingOptions":"HBO + Amazon Prime + SBS On Demand (AU) + Stan (AU)","url":"https://www.youtube.com/watch?v=eawGsbRLzHQ"},{"title":"The Gleaners & I","year":"2000","director":"Agnès Varda","country":"France","genre":"Documentary","synopsis":"Varda’s semi-autobiographical documentary hones in on the often ignored sidelines of human existence and asks the question: what does it mean to glean? Varda is a pioneer of the French new wave; here, her humanitarian focus is highlighted in this handy cam collection of French lives—people who make do, mend, source, recycle, create, define and, above all, collect. A humbling portrait that puts into focus the passing of time, the human capacity to care, and what it really means to live one’s convictions.","recommendation":"Op shopping. DIY. Nature. Human idiosyncrasies. Tenderness. Potatoes.","streamingOptions":"Amazon Prime + Mubi + Kanopy","url":"https://www.youtube.com/watch?v=pbe1EhENzMI"},{"title":"The Great Beauty","year":"2013","director":"Paolo Sorrentino","country":"Italy","genre":"Drama","synopsis":"After his 65th birthday, a writer living the high life in Rome moves beyond the parties to discover the great beauty he’s been seeking. The trailer says it all.","recommendation":"Rome. Luxury. A good party. Existentialism. To take your time, to stop, enjoy and reflect.","streamingOptions":"Google Play + iTunes + Amazon Prime + Kanopy (AU) + SBS On Demand (AU)","url":"https://www.youtube.com/watch?v=Dyt430YkQn0"},{"title":"The Handmaiden","year":"2016","director":"Park Chan-wook","country":"South Korea","genre":"Thriller","synopsis":"Groundbreaking South Korean auteur Park Chan-Wook, revered worldwide by cinephiles and genre fans alike, gives us a twisty, kinky, 1930s-set period piece constructed of interlocking narratives which come together in an old-dark-house mystery that’s taut with thrills and S&M restraints.","recommendation":"Period pieces. Mystery.","streamingOptions":"Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=bafQOb3MGhs"},{"title":"The Player","year":"1992","director":"Robert Altman","country":"United States","genre":"Comedy","synopsis":"A Hollywood studio executive is being sent death threats by a writer whose script he rejected, but which one? The film stars Tim Robbins, Greta Scacchi, Fred Ward, Whoopi Goldberg, Peter Gallagher, Brion James, Cynthia Stevenson, plus 65 (!) celebrity cameos.","recommendation":"The Long Goodbye (1973). A nifty stylish murder story. Film industry politics merging with the classic tropes of true crime.","streamingOptions":"Criterion Channel + Google Play + Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=HpDDTS08wPs"},{"title":"The Souvenir","year":"2019","director":"Joanna Hogg","country":"United States","genre":"Romance","synopsis":"The film is obsessively autobiographical. I wished I had seen this in my early twenties. Depending on who you ask, memory can be incredibly fickle, at times impulsive and untrustworthy, but the thing with memory is that it has to drop anchor somewhere. It exposes what we’ve emotionalized and presents itself as truth, our truth. Memory is counterpoint, it requires putting two disparate images beside each other to see which way the sparks fly. Did it really happen this way or am I just remembering it this way? Watching Joanna Hogg’s ‘The Souvenir’ is watching those sparks fly—an in-depth study on what the texture of memory feels like. She dissects the remoteness that can exist in a relationship from a memory almost 30 years old. What a strange thing to revisit a past self. But to relive it in such a public way, on a large screen, for thousands of strangers to see, is what makes this movie so incorruptible.","recommendation":"Learning how to be yourself in a relationship. Revisiting old memories. Navigating painful breakups.","streamingOptions":"Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=t9Al2nC0vzY"},{"title":"The Third Man","year":"1949","director":"Carol Reed","country":"United Kingdom","genre":"Thriller","synopsis":"In post-war Vienna, an American arrives to work for an old friend, only to find he’s just been killed in mysterious circumstances. A struggle ensues to uncover the truth of what happened, with the complications of an international police presence in the ruins of the city. What happened to Harry Lime? And who was the third man?","recommendation":"Every movie ever made.","streamingOptions":"Hulu + Amazon Prime","url":"https://www.youtube.com/watch?v=r9yyDEDGlr0"},{"title":"The Virgin Suicides","year":"1999","director":"Sofia Coppola","country":"United States","genre":"Mystery","synopsis":"Sofia Coppola made this film when she was just 28 years old. It’s a film of stark contrast. It’s equally one of the most beautiful films you’ll ever watch—visually it has this sort of 70s Playboy vaseline-glazed romance to it—but then it’s also one of the hardest films to watch—in terms of the subject matter. Four teenage sisters are stuck at home under the strict gaze of their parents in 1970s American suburbia. The consequences are haunting.","recommendation":"Suburbia. Sisters. French band Air.","streamingOptions":"Amazon Prime + iTunes + Stan","url":"https://www.youtube.com/watch?v=fbz4-du3Ayg"},{"title":"The Wolfpack","year":"2015","director":"Crystal Moselle","country":"United States","genre":"Documentary","synopsis":"Siblings stuck in their Manhattan home reenacting and reimagining the world through films. The siblings had barely been allowed to leave this apartment over the course of their entire existence, raised in a secluded, near-cult family, allegedly driven by father Oscar’s fear of the real world. With an abusive father and no contact with the outside world, the Angulos became obsessed with feature films, writing out scripts for flicks by pausing the DVDs and then recreating them in fine detail. Film became their only portal to the real world, their way to express their fears and desires.","recommendation":"Sibling rivalry. Being stuck inside. Movies about movies.","streamingOptions":"Amazon Prime + iTunes + Vudu + Lido (AU) + SBS On Demand","url":"https://www.youtube.com/watch?v=rDbqcMfUdlI"},{"title":"Three Billboards Outside Ebbing, Missouri","year":"2017","director":"Martin McDonagh","country":"United States","genre":"Drama","synopsis":"This is a wise, dark comedy about a broken America and it’s hero—the fearless and ferocuous Frances McDormand. As a mother whose teenage daughter was raped and murdered without justice, she’s mad and she’s not taking it anymore. It’s a darkly comic series of interactions between people who have long histories shaded by old hurts and grudges. We watch things surface as we watch the characters poke and prod each other’s wounds and bruises. It’s a familiar story in America that feels insular, with its own wrongs that nobody quite knows how to right.","recommendation":"Frances McDormand. Justice.","streamingOptions":"Amazon Prime + iTunes","url":"https://www.youtube.com/watch?v=Jit3YhGx5pU"},{"title":"Trainspotting","year":"1996","director":"Danny Boyle","country":"United Kingdom","genre":"Comedy","synopsis":"Second only to dreams, nothing sparks the visual imagination of directors like the challenge of translating the experience of being high.","recommendation":"British humor. Ewan McGregor. Drugs.","streamingOptions":"iTunes + Stan","url":"https://www.youtube.com/watch?v=8LuxOYIpu-I"},{"title":"True Romance","year":"1993","director":"Tony Scott","country":"United States","genre":"Action","synopsis":"‘True Romance’ is a story of star-crossed lovers and a super-kinetic joyride. Clarence Worley (a geeky comic store employee played by Christian Slater) meets Alabama Whitman (the most loveable girl you will surely ever meet, played by Patricia Arquette) when she is hired as a call girl as a birthday gift for him from his boss. Their love blossoms. Sparks fly, along with bullets.","recommendation":"Drugs. Love. Californian motels. A woman who can hold her own.","streamingOptions":"Amazon Prime + Vudu","url":"https://www.youtube.com/watch?v=_wNYNDzKpuQ"},{"title":"Variety","year":"1983","director":"Bette Gordon","country":"United States","genre":"Drama","synopsis":"A young woman lands a job as a cashier in an X-rated cinema in Times Square and soon finds herself drawn to what’s happening on the screen. One of the great independent films of the 80s, featuring Nan Goldin and Luis Guzmán, with a score by John Lurie.","recommendation":"Voyeurism.","streamingOptions":"Mubi","url":"https://www.youtube.com/watch?v=wYqJ_P_ySMc"},{"title":"Victoria","year":"2015","director":"Sebastian Schipper","country":"Germany","genre":"Crime","synopsis":"A long night out at a bar that ends in a way no one expected. Every single scene is a peek into Berlin’s nightlife culture and it’s all done in one take. No one believed he could shoot a film in only one sequence and he did it; we start in a cafe, move to a club and end at a bank heist gone wrong. Nils Frahm’s soundtrack adds that extra layer of Berlin by night authenticity, and also just makes you want to go out for a dance.","recommendation":"Nightclubbing. Berlin. Staying up all night.","streamingOptions":"Amazon Prime + iTunes + Kanopy (AU)","url":"https://www.youtube.com/watch?v=Kp8wcV3GjW0"},{"title":"Wanda","year":"1970","director":"Barbara Loden","country":"United States","genre":"Crime","synopsis":"The first and only film made by Barbara Loden—truly a shooting star who abandons her family, in pursuit of some sense of self. This was the only film she wrote, directed and acted in—inspired by a bizarre newspaper clipping she saw about a woman who would rather go to prison than continue on with her life. Each scene feels like a film photograph; the grimy hotel rooms, bar rooms, and bathrooms scattered across Pennsylvania, and the unbathed rawness of Barbara Loden’s performance will not leave you. She is a woman persuaded by what she doesn’t want, killing time and, as it happens, on the fly with a bank robber she barely knows. There is a great little read by Dorothy Publishing Project called ‘Suite for Barbara Loden’ by Nathalie Léger—a great post-film read.","recommendation":"Female writers, actors and directors.","streamingOptions":"Criterion Channel"},{"title":"Wings of Desire","year":"1987","director":"Wim Wenders","country":"Germany","genre":"Fantasy","synopsis":"Damiel and Cassiel are two angels who observe Berlin, providing hope to the distressed. Damiel soon falls in love with a trapeze artist, Marion. He yearns to experience life in the real physical world and goes on a journey to take human form to be with his love.","recommendation":"Angels. Love stories. Berlin. Existentialism. Nick Cave.","streamingOptions":"iTunes + Criterion Channel + Amazon Prime","url":"https://www.youtube.com/watch?v=hAzzR2Uklok"},{"title":"Yi Yi","year":"2000","director":"Edward Yang","country":"Taiwan","genre":"Drama","synopsis":"Edward Yang’s final feature and his most widely acclaimed film (winning him best director at the 2000 Cannes), ‘Yi Yi’ is a delicate and complex family drama, a plaintive city symphony, and an intricate story of incalculable grief. It focuses on a middle-class family in contemporary Taipei. N.J. is disillusioned with his job at a tech company. His wife Min-Min is seized by an existential panic over her monotonous existence. Their teenage daughter Ting-Ting, who fears her thoughtlessness may be responsible for her grandmother’s stroke, strikes up a friendship with a new neighbor and that girl’s troubled boyfriend. And the eight-year-old Yang-Yang, subjected to bullying at school, retreats into his own imagination. To watch the film is to observe life’s everyday crises, to get a glimpse of Taipei’s cityscapes before the turn of the millennium, and to see the omega point of Yang’s cinema.","recommendation":"Hou Hsiao-Hsien. Yasujiro Ozu. Italian neorealism. Slow brewing emotions. The feeling of crying and not knowing why you’re crying.","streamingOptions":"Criterion Channel","url":"https://www.youtube.com/watch?v=8F6tSorwYqw"}]